---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettingIterator
source: html/124c6b6d-9730-696e-1e96-66c3159512aa.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettingIterator Method

Returns a DuctSizeSettingIterator object that iterates through the collection.

## Syntax (C#)
```csharp
public DuctSizeSettingIterator GetDuctSizeSettingIterator()
```

## Returns
A DuctSizeSettingIterator object that can be used to iterate through key-value pairs in the collection.